many_connections/many_conn_test32.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 11.429 ms
initial connection time = 5.988 ms
tps = 174.996806 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 16.675 ms
initial connection time = 60.772 ms
tps = 239.886390 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 4.069 ms
initial connection time = 4.115 ms
tps = 491.521258 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 9.015 ms
initial connection time = 40.397 ms
tps = 443.687218 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 21.315 ms
initial connection time = 23.879 ms
tps = 375.318141 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 6
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 26.871 ms
initial connection time = 99.668 ms
tps = 595.441154 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 3
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 51.220 ms
initial connection time = 216.677 ms
tps = 624.755955 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 146.046 ms
initial connection time = 220.226 ms
tps = 438.218096 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 324.747 ms
initial connection time = 296.797 ms
tps = 394.152987 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 500
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 3.033 ms
initial connection time = 23.762 ms
tps = 659.464871 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 250
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 6.832 ms
initial connection time = 7.435 ms
tps = 585.513346 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 125
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 12.610 ms
initial connection time = 91.619 ms
tps = 634.421154 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 62
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 25.736 ms
initial connection time = 107.854 ms
tps = 621.708922 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 31
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 53.997 ms
initial connection time = 171.737 ms
tps = 592.621976 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 16
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 118.501 ms
initial connection time = 249.081 ms
tps = 540.078121 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 8
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 298.365 ms
initial connection time = 451.838 ms
tps = 429.005282 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 256
number of threads: 1
maximum number of tries: 1
number of transactions per client: 4
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 809.250 ms
initial connection time = 646.402 ms
tps = 316.342195 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 512
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 3097.682 ms
initial connection time = 943.818 ms
tps = 165.284881 (without initial connection time)