many_connections/many_conn_test512.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 7.100 ms
initial connection time = 5.530 ms
tps = 281.675859 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 12.572 ms
initial connection time = 64.765 ms
tps = 318.168368 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 27.875 ms
initial connection time = 39.857 ms
tps = 286.998948 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 6
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 40.247 ms
initial connection time = 178.994 ms
tps = 397.545159 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 3
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 54.848 ms
initial connection time = 231.147 ms
tps = 583.427026 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 126.602 ms
initial connection time = 237.191 ms
tps = 505.523236 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 309.586 ms
initial connection time = 351.454 ms
tps = 413.455389 (without initial connection time)